/*The last number in three-digit number
Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.*/

Console.Write("Введите трехзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());
string num = Console.ReadLine();
var last = 
if (number > 999 | number < 100)
{
    Console.WriteLine("Значение не соответствет запросу, попробуйте снова.");
}
else
{
     Console.WriteLine(inputLine.last(num));
}
